{
  "about": "Software engineer with professional full stack development experience and a passion for learning, interpersonal connections, and all things web development, automation, and robotics. Looking for an opportunity to combine my curiosity about new technology with my software engineering background to help build the future.",
  "skills": [
    "Highly motivated self-starter with excellent communication, problem solving, and interpersonal skills. Lifetime learner, tinkerer, and team collaborator experienced in both Agile and Waterfall methodologies."
  ],
  "experience": [
    {
      "company": "Jumpshot",
      "title": "Full Stack Developer",
      "technologies": [
        "JavaScript",
        "Node.js",
        "React.js",
        "MongoDB",
        "Python",
        "Linux",
        "Postman",
        "Jira",
        "HTML",
        "CSS"
      ],
      "startDate": "November 2022",
      "endDate": "Present",
      "description": [
        "Designed a full-stack prototype for a next gen basketball entertainment venue, integrating React, Node.js, and MongoDB for seamless game management and UX.",
        "\tCreated an HMI and custom sensor modules communicating via MQTT and Modbus to enable real-time gameplay on a PLC-operated machine.",
        "\tTrained and implemented a custom computer vision model to track players and basketballs in low-light conditions using Python, CVAT, and Roboflow.",
        "\tEngineered real-time synchronization between hardware, AI, and UI with Socket.io, MQTT, & Modbus to enable live gameplay with dynamic graphics.",
        "\tCreated AI-powered games, leveraging LLMs to dynamically generate gameplay.",
        "\tCo-invented hardware/software solutions described in 4 patent applications.",
        "\tDelivered a prototype experience that secured >$5m of investor funding.",
        "\tProduced specifications and vetted vendors to iterate & scale into final production."
      ]
    },
    {
      "company": "GetSetUp",
      "title": "Software Engineer",
      "technologies": [
        "TypeScript",
        "Python",
        "Next.js",
        "React.js",
        "SQL",
        "Jira",
        "Node.js",
        "AWS",
        "GraphQL"
      ],
      "startDate": "March 2022",
      "endDate": "November 2022",
      "description": [
        "Owned full-stack development to reduce support costs by >$1M/yr by automating agent workflows and minimizing ticket volume, collaborating with support leads:",
        "\tMigrated to Zendesk CRM by building a custom help center, integrating the chat widget, and connecting user databases via event-driven microservices.",
        "\tDeveloped services to import existing data and to merge contextual data into Zendesk tickets for class chat sessions, enabling agents to identify users.",
        "Implemented event-based UX tracking to measure the impact of interface optimizations on search performance and user engagement."
      ]
    },
    {
      "company": "Edge and Spoke",
      "title": "Assistant Sales Manager, Bike Fit Manager, Bike and Ski Technician",
      "startDate": "September 2016",
      "endDate": "October 2020",
      "description": [
        "Managed a team of associates and inventory to ensure customer satisfaction and loyalty through effective communication for a diverse customer base."
      ]
    }
  ],
  "education": [
    {
      "school": "Bellevue College",
      "degree": "B.S. Computer Science, cum laude",
      "startDate": "January 2019",
      "endDate": "June 2022"
    }
  ]
}
